src/Documents/ИС_WB_СборочноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_WB_СборочноеЗадание</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>article</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>convertedPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>isLargeCargo</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>orderUid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fullAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fio</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>longitude</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>latitude</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВВалютеУчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавочныеКоды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>address</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>province</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>area</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>city</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>street</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>home</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>flat</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>entrance</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>longitude</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>latitude</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>offices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>prioritySc</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>skus</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>user</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>fio</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>phone</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_ПоставкиFBS</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_WB_СтатусыСборочныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусWB</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>partA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>partB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этикетка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СборочноеЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ШтрихкодыУпаковокТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыУпаковокТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗначениеШтрихкода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_WB_СборочноеЗадание/Forms/ФормаУпаковкиТоваров/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы   

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #71876
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #71876

//+ ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	ВыполнитьПроверкуНастроекДоступностиРеквизитов();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893

//+ ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893
&НаКлиенте
Процедура ПоставкаПриИзменении(Элемент) 
	
	Если ДанныеСборки.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершениеИзмененияПоставки", ЭтотОбъект);
		ТекстВопроса = "Изменить поставку, данные будут утеряны?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьДанныеСборкиНаСервере();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура Подключаемый_ОткрытьФормуУточненияДанных() Экспорт		
	ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка штрихкода завершилось с ошибкой! Данные не найдены по штрихкоду!");
	Возврат;		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997     

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Функция ОписаниеОповещенияОбработкиКодаМаркировки()	
	Возврат Новый ОписаниеОповещения("ОбработатьШтрихкодыЗавершение", ЭтотОбъект);	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ОбработатьШтрихкодыЗавершение(Результат, Параметры) Экспорт 	
	ВыполнитьПроверкуНаПечать(Результат);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ОчиститьСообщения();
	
	ДанныеШтрихкода = Новый Структура; 
	
	ДанныеШтрихкода.Вставить("ФорматBase64", Ложь); 
	ДанныеШтрихкода.Вставить("Штрихкод", СокрЛП(Данные));
	ДанныеШтрихкода.Вставить("Количество", 1);
	
	//+ ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
	ИС_MP_МаркировкаКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода); 
	//- ИнфоСофт Стояк Ю.К. 16.08.2024 УА #81842
	//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686	
	ПараметрыСканирования = ИС_MP_МаркировкаКлиент.ПараметрыСканирования(ЭтаФорма);  
	
	РезультатОбработкиШтрихкода = ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования);
	
	ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода);
			                                                  
	//ИС_MP_МаркировкаКлиент.ОбработатьДанныеШтрихкода("ОбработатьШтрихкодыЗавершение", ЭтаФорма, ДанныеШтрихкода, ПараметрыСканирования);
	//- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Сумин Д.В. 14.08.2023 УА #57893
&НаКлиенте
Процедура ВыполнитьПроверкуНастроекДоступностиРеквизитов()  
	
	Если ПечататьЭтикеткиЗаказа Тогда
		Элементы.НастройкиПечатиЭтикетокЗаказов.Видимость = Истина;	
	КонецЕсли;
	
	Если ПечататьШтрихкоды Тогда
		Элементы.НастройкиПечатиШтрихкодов.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 14.08.2023 УА #57893

//+ ИнфоСофт Сумин Д.В. 14.08.2023 УА #57893
&НаКлиенте
Процедура ПечататьЭтикеткиЗаказаПриИзменении(Элемент) 
	
	Если ПечататьЭтикеткиЗаказа Тогда
		Элементы.НастройкиПечатиЭтикетокЗаказов.Видимость = Истина;
	Иначе
		Элементы.НастройкиПечатиЭтикетокЗаказов.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Сумин Д.В. 14.08.2023 УА #57893

//+ ИнфоСофт Сумин Д.В. 14.08.2023 УА #57893
&НаКлиенте
Процедура ПечататьШтрихкодыПриИзменении(Элемент)  
	
	Если ПечататьШтрихкоды Тогда
		Элементы.НастройкиПечатиШтрихкодов.Видимость = Истина;
	Иначе
		Элементы.НастройкиПечатиШтрихкодов.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 14.08.2023 УА #57893

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893
&НаКлиенте
Процедура ПоказатьВопросЗавершениеИзмененияПоставки(Результат, Объект) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеСборкиНаСервере();
	Иначе
		Возврат;	
	КонецЕсли;  
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893

//+ ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893
&НаСервере
Процедура ЗаполнитьДанныеСборкиНаСервере()
	//+ ИнфоСофт Сумин Д.В. 01.02.2024 УА #69810
    ДанныеСборки.Очистить();
	//- ИнфоСофт Сумин Д.В. 01.02.2024 УА #69810

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание КАК СборочноеЗадание,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.РазмерWB КАК СборочноеЗаданиеРазмерWB
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|ГДЕ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка = &Поставка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.СборочноеЗадание КАК СборочноеЗадание,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ИС_WB_СоответствиеРазмеров.Характеристика) КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ВТ_СборочныеЗадания.СборочноеЗаданиеРазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СборочныеЗадания.СборочноеЗадание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СборочныеЗадания.СборочноеЗадание КАК СборочноеЗадание,
	|	ВТ_СборочныеЗадания.СборочноеЗадание.Номер КАК НомерОтправления,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ПО ВТ_СборочныеЗадания.СборочноеЗадание = ВТ_Номенклатура.СборочноеЗадание";
	
	Запрос.УстановитьПараметр("Поставка", Поставка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = ДанныеСборки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893	

//+ ИнфоСофт Сумин Д.В. 08.02.2024 УА #70157
&НаКлиенте
Процедура ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода)
	
	//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
	//ДанныеШтрихкода = РезультатОбработкиШтрихкода;
	ДанныеШтрихкода = РезультатОбработкиШтрихкода.ДанныеШтрихкода;
	//- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686 
	
	//На момент сканирования нет понимния какой вид маркированной продукции сканируется. Поэтому стандартный механизм не используется. 
	//+ ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747 
	РезультатРазбора = РазборКодаМаркировкиНаСервере(ДанныеШтрихкода.НормализованныйШтрихкод);
	//РезультатРазбора = РазборКодаМаркировкиИССлужебныйКлиент.РазобратьКодМаркировки(ДанныеШтрихкода.НормализованныйШтрихкод);
	//- ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747
	
	Если РезультатРазбора <> Неопределено Тогда
		ДанныеШтрихкодаУпаковки = ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора);
		ДанныеШтрихкода = ДанныеШтрихкодаУпаковки;
	Иначе
		ДанныеШтрихкодаУпаковки = Неопределено;
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 16.09.24 УА #83473
	//Если ДанныеШтрихкодаУпаковки = Неопределено И Не ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура) Тогда
	Если ДанныеШтрихкодаУпаковки = Неопределено И ДанныеШтрихкода = Неопределено Тогда		
		//ОбщегоНазначенияКлиент.СообщитьПользователю("Не найдены данные по коду " + ДанныеШтрихкода.Штрихкод);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не найдены данные по коду ");
	//- ИнфоСофт Заварин К.В. 16.09.24 УА #83473
		Возврат;		
	КонецЕсли;	
	
	СтрокаТЗДанныеСборки = Неопределено;   
	
	Для Каждого Строка Из ДанныеСборки Цикл
		Если Строка.Номенклатура = ДанныеШтрихкода.Номенклатура И Строка.Характеристика = ДанныеШтрихкода.Характеристика И Не Строка.ЭтикеткаРаспечатана Тогда
			СтрокаТЗДанныеСборки = Строка;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если СтрокаТЗДанныеСборки = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("По отсканированному штрихкоду не найдено доступного заказа для печати этикетки.");
		Возврат;
	КонецЕсли;	
	
	Попытка
		ВыполнитьПечатьЭтикетки(СтрокаТЗДанныеСборки); 
		
		СтрокаТЗДанныеСборки.ЭтикеткаРаспечатана = Истина;
		СтрокаТЗДанныеСборки.ШтрихкодУпаковки = ДанныеШтрихкода.ШтрихкодУпаковки;
		
		Если ЗначениеЗаполнено(СтрокаТЗДанныеСборки.ШтрихкодУпаковки) Тогда 
			СтрокаТЗДанныеСборки.Киз = ДанныеШтрихкода.НормализованныйШтрихкод; 
		КонецЕсли;
		
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 08.02.2024 УА #70157

//+ ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893
&НаКлиенте
Процедура ВыполнитьПечатьЭтикетки(СтрокаТЗДанныеСборки) 
	
	Если ПечататьЭтикеткиЗаказа Тогда
		ЭтикеткаЗаказа = ПолучитьЭтикеткиНаСервере(СтрокаТЗДанныеСборки.СборочноеЗадание);
						
		Если ЗначениеЗаполнено(НастройкиПечатиЭтикеток) Тогда 		
			ВыполнитьНастройкуТабличногоДокумента(ЭтикеткаЗаказа, НастройкиПечатиЭтикеток);			
		КонецЕсли;
		
		ЭтикеткаЗаказа.Напечатать(); 
						
	КонецЕсли; 
	
	Если ПечататьШтрихкоды Тогда
		ЭтикеткаШтрихкода = ПолучитьШтрихкодовНаСервере(СтрокаТЗДанныеСборки.СборочноеЗадание);  
						
		Если ЗначениеЗаполнено(НастройкиПечатиШтрихкодов) Тогда 	
			ВыполнитьНастройкуТабличногоДокумента(ЭтикеткаШтрихкода, НастройкиПечатиШтрихкодов);	
		КонецЕсли;
		
		ЭтикеткаШтрихкода.Напечатать();
		
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893

//+ ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893
&НаСервере
Функция ПолучитьЭтикеткиНаСервере(ВыделенныеСтроки)

	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьЭтикеток";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_QR58х40");
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.Номер КАК СборочноеЗаданиеНомер,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Этикетка КАК Этикетка,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.НоменклатураWB.vendorCode КАК СборочноеЗаданиеНоменклатураWBvendorCode,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.НоменклатураWB.Наименование КАК СборочноеЗаданиеНоменклатураWBНаименование,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание.НоменклатураWB.Код КАК СборочноеЗаданиеНоменклатураWBКод
	|ИЗ
	|	РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|ГДЕ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание В(&МассивСсылок)";
	
	Запрос.Текст = СтрШаблон(Запрос.Текст);
	
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать этикетки WildBerries");
		Возврат Табдок;	
	КонецЕсли;
		
	ОбластьЭтикетка = МакетОбработки.ПолучитьОбласть("Этикетка");
						
	Выборка = РезультатЗапроса.Выбрать();
	
	Первый = Истина;	
	Пока Выборка.Следующий() Цикл  
				
		ОбластьЭтикетка.Рисунки.КартинкаQR.Картинка = Новый Картинка(Выборка.Этикетка.Получить()); 
		
		Если Не Первый Тогда
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Первый = Ложь;
			
		Табдок.Вывести(ОбластьЭтикетка);
			
	КонецЦикла;    
			
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 21.07.2023 УА #57893

//+ ИнфоСофт Сумин Д.В. 11.08.2023 УА #57893
&НаКлиенте
Процедура ПрикрепитьКиЗы(Команда)  

	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Профиль", ПолучитьПрофиль(Поставка));
	ПараметрыФормы.Вставить("Товары", ДанныеСборки);
	
	ОткрытьФорму("Документ.ИС_WB_СборочноеЗадание.Форма.ФормаКиЗов", ПараметрыФормы, ЭтотОбъект);  
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 11.08.2023 УА #57893

//+ ИнфоСофт Сумин Д.В. 11.08.2023 УА #57893
&НаСервере
Функция ПолучитьШтрихкодовНаСервере(ВыделенныеСтроки)
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_WB_ПечатьШтрихкодов";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_Штрихкод58х40");
			
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_WB_ХарактеристикиКатегорий.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Цвет
	|ИЗ
	|	Справочник.ИС_WB_ХарактеристикиКатегорий КАК ИС_WB_ХарактеристикиКатегорий
	|ГДЕ
	|	ИС_WB_ХарактеристикиКатегорий.Наименование = ""Цвет""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Номер КАК НомерЗаказаСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код КАК КодНоменклатурыСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК АртикулПоставщикаНоменклатурыСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize КАК РазмерСВБ,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_НоменклатураХарактеристикиЦвет.Значение, """")) КАК ЦветСВБ,
	|	МАКСИМУМ(ЕСТЬNULL(ИС_WB_СборочноеЗаданиеskus.Штрихкод, """")) КАК ШтрихкодСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование КАК НаименованиеНоменклатурыСМаркетплейса,
	|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура1С,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика1С
	|ПОМЕСТИТЬ ВТ_ДанныеМаркетплейса
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура.Характеристики КАК ИС_WB_НоменклатураХарактеристикиЦвет
	|		ПО (ИС_WB_СборочноеЗадание.НоменклатураWB = ИС_WB_НоменклатураХарактеристикиЦвет.Ссылка)
	|			И (ИС_WB_НоменклатураХарактеристикиЦвет.Поле В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Цвет КАК ВТ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_WB_СборочноеЗадание.skus КАК ИС_WB_СборочноеЗаданиеskus
	|		ПО (ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СборочноеЗаданиеskus.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СборочноеЗадание.Номер,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Код,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode,
	|	ИС_WB_СборочноеЗадание.РазмерWB.techSize,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование,
	|	ИС_WB_СборочноеЗадание.Заказ,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика
	|;
	|" + ИС_МП_Печать.ТекстЗапросаПараметровПечатиШтрихкодов();
		
	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать штрихкоды WildBerries");
		Возврат Табдок;	
	КонецЕсли;
		
	ОбластьЭтикетка = МакетОбработки.ПолучитьОбласть("Этикетка");
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон"); 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
					
	Выборка = РезультатЗапроса.Выбрать();
	
	Первый = Истина;	
	Пока Выборка.Следующий() Цикл
	    
	    //+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
		//ОбластьЭтикетка.Параметры.Наименование  = Выборка.Наименование;
		//ОбластьЭтикетка.Параметры.Артикул = Выборка.vendorCode;
		//ОбластьЭтикетка.Параметры.Цвет	  = Выборка.Цвет;
		//ОбластьЭтикетка.Параметры.Размер  = Выборка.techSize;
		ЗаполнитьЗначенияСвойств(ОбластьЭтикетка.Параметры, Выборка);
		//- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
		    
		ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
				
		ПараметрыШК.Ширина = Окр(ОбластьЭтикетка.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
		ПараметрыШК.Высота = Окр(ОбластьЭтикетка.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
		//+ ИнфоСофт Мурсалимов Д.Р. 05.10.23 УА #62139
		//ПараметрыШК.ТипКода = 1;
		//- ИнфоСофт Мурсалимов Д.Р. 05.10.23 УА #62139
		ПараметрыШК.РазмерШрифта = 10;
		//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816		
		//ПараметрыШК.Штрихкод = Выборка.Штрихкод;
		ПараметрыШК.Штрихкод = Выборка.ШтрихкодСМаркетплейса;
		//- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
		ПараметрыШК.Масштабировать = Истина;
		ПараметрыШК.СохранятьПропорции = Истина;
		ПараметрыШК.ВертикальноеВыравнивание = 2; 
		
		СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
		
		Если СтруктураКартинки.Результат Тогда	
			ОбластьЭтикетка.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
		КонецЕсли;  
		
		Если Не Первый Тогда
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Первый = Ложь;
			
		Табдок.Вывести(ОбластьЭтикетка);
			
	КонецЦикла;    
			
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 11.08.2023 УА #57893

//+ ИнфоСофт Сумин Д.В. 11.08.2023 УА #57893
&НаСервере
Процедура ВыполнитьНастройкуТабличногоДокумента(Этикетка, НастройкиПечати)
	
	Этикетка.ИмяПринтера = НастройкиПечати.ИмяПринтера; 
	Этикетка.ПолеСлева = НастройкиПечати.Слева;
	Этикетка.ПолеСправа = НастройкиПечати.Справа;
	Этикетка.ПолеСнизу = НастройкиПечати.Снизу;
	Этикетка.ПолеСверху = НастройкиПечати.Сверху;	
	Этикетка.РазмерКолонтитулаСверху = НастройкиПечати.КолонтитулыСверху;
	Этикетка.РазмерКолонтитулаСнизу = НастройкиПечати.КолонтитулыСнизу; 
	Этикетка.ЭкземпляровНаСтранице = НастройкиПечати.ЭкземпляровНаСтраницу; 
	
	Если НастройкиПечати.ОриентацияСтраницы = 0 Тогда 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Иначе 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	Если НастройкиПечати.Масштаб = 0 Тогда 
		Этикетка.АвтоМасштаб = Истина;
	Иначе 
		Этикетка.АвтоМасштаб = Ложь;
		Этикетка.МасштабПечати = НастройкиПечати.МасштабЗначение;	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.12.24 УА #72698

	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 11.08.2023 УА #57893

//+ ИнфоСофт Сумин Д.В. 11.08.2023 УА #57893
&НаСервере
Функция ПолучитьПрофиль(ДанныеПоставка)
	Возврат Поставка.Профиль;	
КонецФункции //- ИнфоСофт Сумин Д.В. 11.08.2023 УА #57893

//+ ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747
&НаСервере
Функция РазборКодаМаркировкиНаСервере(НормализованныйШтрихкод)
	
	Возврат ИС_MP_Маркировка.РазборКодаМаркировки(НормализованныйШтрихкод);
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 05.03.24 УА #70747

//+ ИнфоСофт Сумин Д.В. 08.02.2024 УА #70157
&НаСервере
Функция ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокТоваров.Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", РезультатРазбора.НормализованныйКодМаркировки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Результат = Новый Структура;
	
	Результат.Вставить("Номенклатура", Выборка.Номенклатура);
	Результат.Вставить("Характеристика", Выборка.Характеристика);
	//+ ИнфоСофт Сумин Д.В. 09.02.2024 УА #70157
	//Результат.Вставить("НормализованныйШтрихкод", РезультатРазбора.НормализованныйКодМаркировки);
	Результат.Вставить("НормализованныйШтрихкод", РезультатРазбора.КодМаркировки); 
	//- ИнфоСофт Сумин Д.В. 09.02.2024 УА #70157

	Результат.Вставить("ШтрихкодУпаковки", Выборка.Ссылка);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 08.02.2024 УА #70157

//+ ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686
&НаСервере
Функция ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения = Неопределено)

	Возврат ИС_MP_Маркировка.ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, ЭтаФорма.УникальныйИдентификатор);	
			
КонецФункции //- ИнфоСофт Стояк Ю.К. 13.08.2024 УА #81686

#КонецОбласти
